[
  {
    "id": "001",
    "dish": "Asparagus, Mushroom, Leek, and Cheese Galette",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Daniel Gritzer",
    "prepTime": "30 min.",
    "nutrition_facts":"268 calories, 8g fat (3g saturated fat), 83mg cholesterol, 560mg sodium, 6g carbohydrate (5g sugars, 0 fiber), 40g protein.",
    "dishDesc": "A crispy, flaky, and buttery free-form crust wraps around a savory filling of spring ingredients—tender asparagus, melted leeks, and earthy mushrooms, with Fontina cheese tying everything together.",
    "ingredients": ["1/2 batch Old-Fashioned Flaky Pie Dough", "1/4 cup plus 1 tablespoon (75ml) extra-virgin olive oil, divided, plus more for drizzling", "1 pound (450g) mixed mushrooms, such as cremini, stemmed and caps sliced 1/4 inch thick", "Kosher salt", "1 pound (450g) asparagus, woody ends trimmed, stalks cut on the bias 1/4 inch thick, tips reserved", "1 teaspoon minced fresh thyme leaves", "1 1/2 pounds leeks, white and light green parts only, halved lengthwise then cut crosswise into 1/4 inch thick half-moons", "2 ounces (55g) grated Fontina cheese", "1 large egg, beaten"],
    "directions": ["Prepare Old-Fashioned Flaky Pie Dough according to the recipe. After rolling, folding, and dividing dough in half, roll one portion into a 14-inch round. Transfer to a parchment-lined aluminum rimmed baking sheet, cover with plastic, and refrigerate to relax and chill dough, at least 2 hours or up to 24.", "In a large sauté pan or cast iron skillet, heat 4 tablespoons (60ml) olive oil over medium-high heat until shimmering. Add mushrooms and cook, stirring occasionally, until browned, about 6 minutes.", "Stir in asparagus stalks, thyme, and the remaining 1 tablespoon (15ml) olive oil. Lower heat to medium and cook, tossing and stirring, until asparagus is tender, about 8 minutes. Add 3 tablespoons (45ml) water to skillet, scraping up browned bits from bottom of pan. Season with salt and remove from heat.", "Meanwhile, in a large saucepan, melt butter over medium heat until foaming. Add leeks and cook, stirring, until very soft, about 8 minutes. Lower heat if necessary to prevent browning. Season with salt.", "Add the leeks to the asparagus mixture along with the cheese and stir to combine.", "Adjust oven rack to lower-middle position and preheat to 400°F. Spread asparagus-leek mixture on prepared dough round, leaving about a 2-inch border of dough all around. With a sharp knife, cut a series of slits in the border of dough, each running from filling to edge of dough, spacing them about 5 inches apart. Fold each segment of dough over filling, tugging gently so the edge of each segment tightly overlaps the one that came before. Chill galette for 10 minutes in the refrigerator.", "In a small bowl, drizzle reserved asparagus tips with olive oil, season with salt, and toss to coat lightly and evenly. Arrange asparagus tips on top of exposed filling in center of the galette.", "Brush egg over chilled dough in a thin, even layer (including under each flap). This will give the crust a glossy, golden sheen and help bind the pieces together.", "Bake until galette is golden brown around the edges and bubbling in the center, about 45 minutes longer. Let cool 5 minutes, then slice into wedges and serve warm." ] 
    },
    {
    "id": "002",
    "dish": "Lemony Broiled Potatoes With Halloumi Cheese",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Michael Harlan Turkell",
    "prepTime": "Cook: 30 min.",
    "nutrition_facts": "89 calories, 1g fat (0 saturated fat), 0 cholesterol, 149mg sodium, 17g carbohydrate (3g sugars, 1g fiber), 2g protein. Diabetic Exchanges: 1 starch.",
    "dishDesc": "Browned on top, creamy on bottom, and bright with lemon, these broiled potatoes topped off with melty halloumi cheese combine the best of roast potatoes and gratin.",
    "ingredients": ["2 tablespoons (30ml) extra-virgin olive oil", "1 pound (450g) Yukon Gold potatoes, sliced 1/8 inch thick", "Kosher or sea salt", "Freshly ground black pepper", "1/4 cup (60ml) fresh lemon juice, from about 1 lemon, plus zest of 1 lemon", "8 ounces (225g) halloumi cheese, thinly sliced", "2 teaspoons dried oregano"],
    "directions": ["Preheat broiler and set top oven rack about 6 inches from broiler element. Add olive oil to a 12-inch cast iron skillet and spread evenly all over.", "Add potatoes, shingling the slices around the pan in a single circular layer. Season with salt and pepper.", "Broil until the potatoes have puffed up slightly, mostly cooked through, and browned on top, about 7 minutes.", "Pour lemon juice all over potatoes and sprinkle zest on top.", "Add halloumi cheese in an even layer on top and broil until cheese is golden brown all over and potatoes are fully cooked through, about 4 minutes.Sprinkle oregano on top and serve."]
  },

  {
    "id": "003",
    "dish": "Carciofi alla Romana: The Other Delicious Roman Artichoke Dish",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Daniel Gritzer",
    "prepTime": "Cook: 30 min",
    "nutrition_facts": " 130 calories, 4g fat (1g saturated fat), 25mg cholesterol, 111mg sodium, 21g carbohydrate (10g sugars, 1g fiber), 3g protein.",
    "dishDesc": "There are many reasons not to cook artichokes out of season, the least obvious of which is that they can spontaneously combust. I'm not joking. I was trimming some leathery artichokes a few months ago, in the middle of summer, and they began to catch fire from the friction of the blade as I sliced through the dry, woody leaves. You can see proof of it on this Twitter thread.",
    "ingredients": ["2 whole lemons (for maintaining artichokes' color)", "4 large or 12 small artichokes (2 pounds; 1kg)", "1/4 cup (7g) minced flat-leaf parsley leaves", "2 tablespoons minced fresh mint leaves", "2 tablespoons minced fresh oregano leaves", "3 medium cloves garlic, minced", "1/4 cup (60ml) extra-virgin olive oil, plus more for drizzling", "1/4 cup (60ml) dry white wine", "Kosher salt and freshly ground black pepper"],
    "directions": ["Fill a large bowl with water; halve and squeeze 2 lemons into it. Trim artichokes by cleaning them down to the hearts, following the guidelines shown here: Using a serrated knife, cut off top of artichoke and bottommost part of stem. Using a paring knife or sharp vegetable peeler, trim away the tough outer leaves to expose the tender inner leaves and heart. Trim away fibrous outer layer around stem to expose tender inner core (if stem breaks off, that's okay; just save it and cook it alongside the hearts). Using a spoon, scrape out the inedible, hairy choke in the center of each heart. Transfer cleaned artichokes to bowl of lemon water as you work, covering them with a clean kitchen towel to keep them completely submerged.", "In a small bowl, stir together parsley, mint, oregano, and garlic. Rub concave side of each artichoke heart with herb mixture, packing it into any leafy crevices. Set aside remaining herb mixture.", "Add olive oil and wine to a pot just large enough to hold all the artichokes closely side by side, so that they can sit flat with their stem sides up. Arrange artichokes in pot and season with salt and pepper.", "Bring pot to a simmer over medium-high heat, then lower heat to a bare simmer, cover, and cook until artichokes are fork-tender, 20 to 30 minutes. (Smaller artichokes may not take as long.)", "Remove from heat and transfer artichokes to a platter, stem sides up. Drizzle with cooking juices, along with some fresh olive oil and a light sprinkling of reserved herb mixture. Serve warm or at room temperature."]
  },  
  {
    "id": "004",
    "dish": "Grilled Oysters Recipe",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "J. Kenji López-Alt",
    "prepTime": "Cook: 30 min",
    "nutrition_facts": "550 calories, 33g fat (19g saturated fat), 202mg cholesterol, 179mg sodium, 60g carbohydrate (37g sugars, 2g fiber), 6g protein.",
    "dishDesc": "I am an East Coast oyster fiend, but I can't abide West Coast oysters served raw. So, when a buddy of mine recently gave me a whole case of gorgeous Kusshi oysters from British Columbia for helping him out with an oyster-shucking job, I immediately knew there was only one way I was going to be enjoying these deep-cupped beauties: on the grill. Topping them with compound butter is a simple, classic way to prepare them.",
    "ingredients": [
      "1 dozen oysters",
      "4 to 5 ounces compound butter, such as garlic-parsley butter,",
      "kimchi butter, or Parmesan-basil butter",
      "Seaweed or kosher salt, for serving"
    ],
    "directions": [
      "Line a rimmed baking sheet with heavy-duty aluminum foil, crinkling it up to create deep creases. Shuck oysters, discard top shells, and place them on foil-lined baking sheet, using foil to keep them upright so that juices do not spill out.",
      "Light one chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and arrange coals on one side of charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil grilling grate.",
      "Place oysters directly over hot side of grill. Using 2 spoons, place 2 teaspoons (10ml) of compound butter inside each. Cover and cook until butter is melted and liquid is bubbling, about 2 minutes. Transfer to a serving platter lined with seaweed or moistened kosher salt (to keep oysters level; see note) and serve immediately."
    ]
  },
  {
    "id": "005",
    "dish": "Charred Asparagus With Miso Béarnaise Sauce Recipe",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Sasha Marx",
    "prepTime": "Cook: 40 min",
    "nutrition_facts": "416 calories, 19g fat (4g saturated fat), 86mg cholesterol, 698mg sodium, 26g carbohydrate (2g sugars, 2g fiber), 32g protein. Diabetic Exchanges: 5 lean meat, 1-1/2 starch.",
    "dishDesc": "For an easy steak dinner side dish, char asparagus in the time it takes for your rib-eye to rest. Drizzle them both with a jazzed-up béarnaise that gets an umami boost from white miso. Why drop big bucks at a stuffy steakhouse when you can live large at home? No jacket required.",
    "ingredients": [
      "1/2 cup (120ml) dry white wine",
      "1/4 cup (60ml) white wine vinegar",
      "1 large shallot (30g), sliced thin",
      "3 sprigs tarragon, leaves finely minced, stems reserved separately",
      "1/2 teaspoon (2g) whole black peppercorns",
      "2 large egg yolks (36g)",
      "1 tablespoon (20g) white miso",
      "12 tablespoons (168g) unsalted butter",
      "Kosher salt and freshly ground black pepper",
      "1 pound (450g) asparagus, woody ends trimmed",
      "1 tablespoon (15ml) vegetable oil, divided"
    ],
    "directions": [
      "In a small saucepan, combine wine, vinegar, shallots, tarragon stems, and black peppercorns, and bring to a simmer over medium-high heat. Adjust heat to maintain a gentle simmer and cook until reduced to about 1 1/2 tablespoons of liquid, 10 to 12 minutes. Carefully strain liquid through a fine-mesh strainer into a small bowl, pressing on the solids with the back of a spoon to extract as much liquid as possible. Let mixture cool slightly.",
      "In a tall-sided cup that barely fits the head of an immersion blender, combine egg yolks, miso, and the wine-vinegar reduction. Using an immersion blender. Blend mixture until well-combined, about 30 seconds.",
      "Meanwhile, in a small saucepan, melt butter over high heat, swirling constantly, until foaming subsides. Transfer butter to a 1-cup liquid measuring cup. Heat a large cast iron skillet over high heat.",
      "Place head of immersion blender into the bottom of the cup and turn it on. With the blender constantly running, slowly pour hot butter into cup in a thin and steady stream. Continue blending, raising and lowering blender head slightly to fully emulsify butter with the egg yolk mixture. Sauce should be thick and creamy, able to coat a spoon but still flow off of it. If it is too thick, whisk in a small amount of water to thin it out. Stir in minced tarragon and season to taste with salt. Transfer to a small lidded pot and keep in a warm place for up to 1 hour before serving. Béarnaise cannot be cooled and reheated.",
      "Add half of the asparagus to the preheated cast iron skillet and arrange in a single layer. Cook, turning occasionally, until spears are lightly charred all over and just cooked through, 4 to 6 minutes for thin spears, 5 to 8 minutes for thick spears.",
      "Carefully add half of the vegetable oil to the skillet, toss to coat asparagus with oil, and season with salt and pepper to taste. Transfer asparagus to a warmed serving plate. Repeat with remaining asparagus and vegetable oil. Serve immediately, passing béarnaise sauce at the table."
    ]
  },
  {
    "id": "006",
    "dish": "Colcannon Potatoes",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Marilou Robinson",
    "prepTime": "Prep: 25 min. Cook: 35 min.",
    "nutrition_facts": "1 cup: 168 calories, 5g fat (3g saturated fat), 14mg cholesterol, 361mg sodium, 27g carbohydrate (6g sugars, 4g fiber), 4g protein. Diabetic Exchanges: 2 starch, 1 fat.",
    "dishDesc": "'Every Irish family has its own colcannon recipe, since it's a classic dish. My recipe comes from my father's family in Ireland. It's part of my St. Pat's menu, along with lamb chops, carrots and soda bread.'",
    "ingredients": [
      "1 medium head cabbage (about 2 pounds), shredded",
      "4 pounds medium potatoes (about 8), peeled and quartered",
      "2 cups whole milk",
      "1 cup chopped green onions",
      "1-1/2 teaspoons salt",
      "1/2 teaspoon pepper",
      "1/4 cup butter, melted",
      "Minced fresh parsley",
      "Crumbled cooked bacon"
    ],
    "directions": [
      "Place cabbage and 2 cups water in a large saucepan; bring to a boil. Reduce heat; simmer, covered, until cabbage is tender, about 10 minutes. Drain, reserving cooking liquid; keep cabbage warm in separate dish.",
      "In same pan, combine potatoes and reserved cooking liquid. Add additional water to cover potatoes; bring to a boil. Reduce heat; cook, uncovered, until potatoes are tender, 15-20 minutes. Meanwhile, place milk, green onions, salt and pepper in a small saucepan; bring just to a boil and remove from heat.",
      "Drain potatoes; place in a large bowl and mash. Add milk mixture; beat just until blended. Stir in cabbage. To serve, drizzle with butter; top with parsley and bacon."
    ]
  },
  {
    "id": "007",
    "dish": "Irish Spiced Beef",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Mary Shenk",
    "prepTime": "Prep: 20 min. + chilling Bake: 4 hours + chilling",
    "nutrition_facts": "4 ounces cooked beef (calculated without bread, cheese and mustard): 268 calories, 8g fat (3g saturated fat), 83mg cholesterol, 560mg sodium, 6g carbohydrate (5g sugars, 0 fiber), 40g protein.",
    "dishDesc": "'The story goes that my Irish ancestors brought this recipe along when they immigrated to the U.S. Start it at least five days ahead to spice and tenderize the meat; the flavors are worth it.'",
    "ingredients": [
      "1 fresh beef brisket (6 pounds)",
      "1/3 cup packed brown sugar",
      "3/4 cup coarse sea salt",
      "1/4 cup chopped onion",
      "4 bay leaves, crushed",
      "3 teaspoons pepper",
      "2 teaspoons dried rosemary, crushed",
      "2 teaspoons dried thyme",
      "1-1/2 teaspoons ground allspice",
      "1-1/2 teaspoons ground cloves",
      "4 medium onions, sliced",
      "4 medium carrots, sliced",
      "2 celery ribs, sliced",
      "2 cups stout or beef broth",
      "Optional: Rye bread, Swiss cheese slices and Dijon mustard"
    ],
    "directions": [
      "Place beef in a 15x10x1-in. baking pan; rub with brown sugar. Refrigerate, covered, 24 hours.",
      "In a small bowl, mix salt, chopped onion, bay leaves and seasonings; rub over beef. Refrigerate, covered, 3 days, turning and rubbing salt mixture into beef once each day.",
      "Preheat oven to 325°. Remove and discard salt mixture. Place beef, onions, carrots, celery and stout in a roasting pan. Add water to come halfway up the brisket. Roast, covered, 4-4-1/2 hours or until meat is tender. Cool meat in cooking juices for 1 hour.",
      "Remove beef; discard vegetables and cooking juices. Transfer beef to a 13x9-in. baking dish. Refrigerate, covered, overnight.",
      "Cut diagonally across the grain into thin slices. Serve with rye bread, cheese and mustard."
    ]
  },
  {
    "id": "008",
    "dish": "Scottish Oatmeal Rolls",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Peggy Goodrich",
    "prepTime": "Prep: 30 min. + rising Bake: 20 min.",
    "nutrition_facts": "1 roll: 89 calories, 1g fat (0 saturated fat), 0 cholesterol, 149mg sodium, 17g carbohydrate (3g sugars, 1g fiber), 2g protein. Diabetic Exchanges: 1 starch.",
    "dishDesc": "'My family likes rolls that can hold up to scooping gravies, sauces and more. This recipe is a favorite. The oatmeal in the dough gives it a Scottish touch.'",
    "ingredients": [
      "1-1/2 cups boiling water",
      "1-1/2 cups old-fashioned oats",
      "1/3 cup packed brown sugar",
      "1-1/2 teaspoons salt",
      "1 tablespoon canola oil",
      "1 package (1/4 ounce) active dry yeast",
      "1/4 cup warm water (110° to 115°)",
      "2-3/4 to 3-1/4 cups all-purpose flour",
      "Optional: Butter and honey"
    ],
    "directions": [
      "Pour boiling water over oats in a large bowl. Add brown sugar, salt and oil. Cool to 110°-115°, stirring occasionally. Meanwhile, in a small bowl, dissolve yeast in warm water; let stand 5 minutes. Add to oat mixture. Beat in enough flour to form a stiff dough (dough will be sticky).",
      "Turn dough onto a floured surface; knead until smooth and elastic, 6-8 minutes. Place in a greased bowl, turning once to grease the top. Cover; let rise in a warm place until doubled, about 1 hour.",
      "Punch dough down. Turn onto a lightly floured surface; divide and shape into 24 balls. Place in a greased 13x9-in. baking pan. Cover with a kitchen towel; let rise in a warm place until doubled, about 30 minutes.",
      "Preheat oven to 350°. Bake until lightly browned, 20-25 minutes. Remove from pan to a wire rack to cool. If desired, serve with butter and honey."
    ]
  },
  {
    "id": "009",
    "dish": "Almond Tea Bread",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Kathleen Showers",
    "prepTime": "Prep: 15 min. Bake: 1-1/4 hours + cooling",
    "nutrition_facts": "1 slice: 130 calories, 4g fat (1g saturated fat), 25mg cholesterol, 111mg sodium, 21g carbohydrate (10g sugars, 1g fiber), 3g protein.",
    "dishDesc": "'My aunt brought her tea bread recipe with her from Scotland, and enjoying a fresh-baked loaf has become a family tradition during the holidays. Each slice is loaded with red cherries'",
    "ingredients": [
      "1 can (8 ounces) almond paste",
      "1/4 cup butter, softened",
      "1 cup sugar",
      "3 large eggs, room temperature",
      "1-1/2 cups fresh pitted cherries or blueberries",
      "3 cups all-purpose flour, divided",
      "4 teaspoons baking powder",
      "1/2 teaspoon salt",
      "3/4 cup whole milk"
    ],
    "directions": [
      "In a large bowl, combine almond paste and butter; beat until well blended. Gradually add sugar, beating until light and fluffy. Add eggs, one at a time, beating well after each addition. In a small bowl, gently toss cherries and 1 tablespoon flour. Set aside.",
      "Combine the baking powder, salt, remaining flour; add to the creamed mixture alternately with milk, beating well after each addition.",
      "Spoon a sixth of the batter into each of two greased and floured 8x4-in. loaf pans; sprinkle layers with half of the fruit. Cover with another layer of batter and sprinkle with remaining fruit. Top with remaining batter; smooth with spatula.",
      "Bake at 350° until a toothpick inserted in the center comes out clean, about 1-1/4 hours. Cool for 10 minutes before removing from pans to wire racks to cool."
    ]
  },
  {
    "id": "010",
    "dish": "English Rhubarb Crumble",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Amy Freeman",
    "prepTime": "Prep: 45 min. Bake: 30 min.",
    "nutrition_facts": "1 each: 550 calories, 33g fat (19g saturated fat), 202mg cholesterol, 179mg sodium, 60g carbohydrate (37g sugars, 2g fiber), 6g protein.",
    "dishDesc": "When I met my English husband and served him just the crumble, he said it was fantastic but really needed a custard sauce over it. We found a terrific sauce recipe from England, and now the pair is perfect together. I wouldn't serve it any other way.",
    "ingredients": [
      "8 cups chopped fresh or frozen rhubarb",
      "1-1/4 cups sugar, divided",
      "2-1/2 cups all-purpose flour",
      "1/4 cup packed brown sugar",
      "1/4 cup quick-cooking oats",
      "1 cup cold butter",
      "custard sauce:",
      "6 large egg yolks",
      "1/2 cup sugar",
      "2 cups heavy whipping cream",
      "1-1/4 teaspoons vanilla extract"
    ],
    "directions": [
      "In a saucepan, combine rhubarb and 3/4 cup sugar. Cover and cook over medium heat, stirring occasionally, until the rhubarb is tender, about 10 minutes.",
      "Pour into a greased 13x9-in. baking dish. In a bowl, combine flour, brown sugar, oats and remaining sugar. Cut in butter until crumbly; sprinkle over rhubarb. Bake at 400° for 30 minutes.",
      "Meanwhile, in a saucepan, whisk the egg yolks and sugar; stir in cream. Cook and stir over low heat until a thermometer reads 160° and mixture thickens, 15-20 minutes. Remove from the heat; stir in vanilla. Serve warm over rhubarb crumble."
    ]
  },
  {
    "id": "011",
    "dish": "Crispy Fish & Chip",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Linda Schend",
    "prepTime": "Prep/Total Time: 30 min.",
    "nutrition_facts": "1 fillet with 3/4 cup fries: 416 calories, 19g fat (4g saturated fat), 86mg cholesterol, 698mg sodium, 26g carbohydrate (2g sugars, 2g fiber), 32g protein. Diabetic Exchanges: 5 lean meat, 1-1/2 starch.",
    "dishDesc": "'A British pub classic turns crown jewel when you add horseradish, panko and Worcestershire. You can also try it with white fish like cod or haddock.'",
    "ingredients": [
      "4 cups frozen steak fries",
      "4 salmon fillets (6 ounces each)",
      "1 to 2 tablespoons prepared horseradish",
      "1 tablespoon grated Parmesan cheese",
      "1 tablespoon Worcestershire sauce",
      "1 teaspoon Dijon mustard",
      "1/4 teaspoon salt",
      "1/2 cup panko bread crumbs",
      "Cooking spray"
    ],
    "directions": [
      "Preheat oven to 450°. Arrange steak fries in a single layer on a baking sheet. Bake on lowest oven rack 18-20 minutes or until light golden brown.",
      "Meanwhile, place salmon on a foil-lined baking sheet coated with cooking spray. In a small bowl, mix horseradish, cheese, Worcestershire sauce, mustard and salt; stir in panko. Press mixture onto fillets. Spritz tops with cooking spray.",
      "Bake salmon on middle oven rack 8-10 minutes or until fish just begins to flake easily with a fork. Serve with fries."
    ]
  },
  {
    "id": "012",
    "dish": "German Potato Dumplings",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Arline Hofland",
    "prepTime": "Prep: 40 min. Cook: 10 min",
    "nutrition_facts": "2 dumplings with 2 tablespoons sauce: 367 calories, 14g fat (8g saturated fat), 100mg cholesterol, 524mg sodium, 51g carbohydrate (2g sugars, 5g fiber), 9g protein.",
    "dishDesc": "'Potato dumplings (called Kartoffel Kloesse in Germany) are a delightful addition to any German feast. The browned butter sauce is delectable.'",
    "ingredients": [
      "3 pounds medium potatoes (about 10), peeled and quartered",
      "1 cup all-purpose flour",
      "3 large eggs, lightly beaten",
      "2/3 cup dry bread crumbs",
      "1 teaspoon salt",
      "1/2 teaspoon ground nutmeg",
      "12 cups water",
      "browned butter sauce:",
      "1/2 cup butter, cubed",
      "1 tablespoon chopped onion",
      "1/4 cup dry bread crumbs"
    ],
    "directions": [
      "Place potatoes in a Dutch oven; add water to cover. Bring to a boil. Reduce heat; cook, uncovered, 15-20 minutes or until tender. Drain; transfer to a large bowl.",
      "Mash potatoes. Stir in flour, eggs, bread crumbs, salt and nutmeg. Shape into sixteen (2-in.) balls.",
      "In a Dutch oven, bring 12 cups water to a boil. Carefully add dumplings. Reduce heat; simmer, uncovered, 7-9 minutes or until a toothpick inserted in center of dumplings comes out clean.",
      "Meanwhile, in a small heavy saucepan, heat butter and onion over medium heat. Heat 5-7 minutes or until butter is golden brown, stirring constantly. Remove from heat; stir in bread crumbs. Serve with dumplings."
    ]
  },
  {
    "id": "013",
    "dish": "Oma’s Apfelkuchen (Grandma’s Apple Cake)",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Amy Kirchen",
    "prepTime": "Prep: 20 min. Bake: 45 min. + cooling",
    "nutrition_facts": "1 slice: 422 calories, 23g fat (14g saturated fat), 148mg cholesterol, 177mg sodium, 50g carbohydrate (28g sugars, 1g fiber), 4g protein.",
    "dishDesc": "'My husband’s German family calls this Oma’s apfelkuchen, which translates to 'Grandma’s apple cake.' They’ve been sharing the recipe for more than 150 years. I use Granny Smith apples, but any variety works.'",
    "ingredients": [
      "5 large egg yolks",
      "2 medium tart apples, peeled, cored and halved",
      "1 cup plus 2 tablespoons unsalted butter, softened",
      "1-1/4 cups sugar",
      "2 cups all-purpose flour",
      "2 tablespoons cornstarch",
      "2 teaspoons cream of tartar",
      "1 teaspoon baking powder",
      "1/2 teaspoon salt",
      "1/4 cup 2% milk",
      "Confectioners' sugar"
    ],
    "directions": [
      "Preheat oven to 350°. Let egg yolks stand at room temperature for 30 minutes. Starting 1/2 in. from 1 end, cut apple halves lengthwise into 1/4-in. slices, leaving them attached at the top so they fan out slightly. Set aside.",
      "Heat cream butter and sugar until light and fluffy, 5-7 minutes. Add egg yolks, 1 at a time, beating well after each addition. In another bowl, sift flour, cornstarch, cream of tartar, baking powder and salt twice. Gradually beat into creamed mixture. Add milk; mix well (batter will be thick).",
      "Spread batter into a greased 9-in. springform pan wrapped in a sheet of heavy-duty foil. Gently press apples, round side up, into batter. Bake until a toothpick inserted in the center comes out with moist crumbs, 45-55 minutes. Cool on a wire rack 10 minutes. Loosen sides from pan with a knife; remove foil. Cool 1 hour longer. Remove rim from pan. Dust with confectioners' sugar."
    ]
  },
  {
    "id": "014",
    "dish": "Aebleskiver",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Kristine Chayes",
    "prepTime": "Prep: 20 min. Cook: 5 min./batch",
    "nutrition_facts": "4 pieces: 160 calories, 2g fat (1g saturated fat), 64mg cholesterol, 530mg sodium, 27g carbohydrate (5g sugars, 1g fiber), 7g protein. Diabetic Exchanges: 2 starch.",
    "dishDesc": "Years ago, a friend returned from visiting her family in Denmark and brought back her family recipe for aebleskiver. After hearing her rave about the tasty Danish pancake balls sold in bakeries and at street markets there, I ordered an aebleskiver pan. I've been making them ever since",
    "ingredients": [
      "3 large eggs, separated, room temperature",
      "2 cups buttermilk",
      "2 cups all-purpose flour",
      "1 teaspoon baking soda",
      "1 teaspoon salt",
      "1/2 teaspoon ground cinnamon",
      "2 medium peaches, peeled and chopped",
      "Confectioners' sugar"
    ],
    "directions": [
      "In a large bowl, whisk egg yolks and buttermilk until blended. In another bowl, whisk flour, baking soda, salt and cinnamon. Stir into egg mixture just until moistened. In a small bowl, beat egg whites on high speed until stiff but not dry. With a rubber spatula, gently stir a fourth of the egg whites into batter. Fold in remaining egg whites.",
      "Place a greased aebleskiver pan over medium heat. In batches, pour 1 tablespoon batter into each cup. Top with a peach piece and another 1 tablespoon batter. Cook until bubbles on top begin to pop and bottoms are golden brown. Turn; cook until second side is golden brown. Serve warm with confectioners' sugar.",
      "Freeze option: Freeze cooled pancakes between layers of waxed paper in a freezer container. To use, place pancakes on an ungreased baking sheet, cover with foil and reheat in a preheated 375° oven until heated through, 5-10 minutes. Or, place on a microwave-safe plate and microwave on high until heated through, 45-90 seconds."
    ]
  },
  {
    "id": "015",
    "dish": "Italian Pasta Sauce",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Judy Braun",
    "prepTime": "Prep: 25 min. Cook: 2-1/2 hours",
    "nutrition_facts": "1 cup: 284 calories, 15g fat (5g saturated fat), 57mg cholesterol, 821mg sodium, 16g carbohydrate (9g sugars, 3g fiber), 23g protein.",
    "dishDesc": "'As a special part of their wedding buffet, my daughter Kris' husband fixed a big batch of this thick flavorful pasta sauce. The recipe was brought by his grandmother from Italy more than 80 years ago.'",
    "ingredients": [
      "4 pounds ground beef",
      "1 pound bulk Italian sausage",
      "1 large onion, finely chopped",
      "3 celery ribs, finely chopped",
      "4 garlic cloves, minced",
      "2 tablespoons olive oil",
      "3 cans (28 ounces each) crushed tomatoes in puree",
      "3 cans (6 ounces each) tomato paste",
      "3 cups chicken or beef broth",
      "1 pound fresh mushrooms, sliced",
      "3/4 cup minced fresh parsley",
      "1 tablespoon sugar",
      "2 to 3 teaspoons salt",
      "1/2 teaspoon pepper",
      "1/2 teaspoon ground allspice",
      "Optional: Hot cooked pasta"
    ],
    "directions": [
      "In a Dutch oven or soup kettle, cook beef in 2 batches over medium heat until no longer pink; drain and set aside. Cook sausage over medium heat until no longer pink; drain and set aside. In the same pan, saute onion, celery and garlic in oil until vegetables are tender.",
      "Return the beef and sausage to the pan. Add the next 9 ingredients, including allspice if desired, and bring to a boil. Reduce heat; cover and simmer until sauce reaches desired thickness, stirring occasionally, 2-3 hours. Serve over pasta.",
      "Freeze option: Freeze cooled sauce in freezer containers. To use, partially thaw in refrigerator overnight. Heat through in a saucepan, stirring occasionally. Add a little broth or water if necessary."
    ]
  },
  {
    "id": "016",
    "dish": "Hazelnut Macarons",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Taste of Home Test Kitchen",
    "prepTime": "Prep: 50 min. Bake: 10 min./batch + cooling",
    "nutrition_facts": "1 sandwich cookie: 117 calories, 8g fat (3g saturated fat), 31mg cholesterol, 67mg sodium, 12g carbohydrate (11g sugars, 0 fiber), 1g protein.",
    "dishDesc": "You don’t have to be an expert in French cooking to whip up these sandwich cookies. The crisp, chewy macarons require attention to detail, but they’re not hard to make—and they’re simply a delight, both for personal snacking and giving as gifts!",
    "ingredients": [
      "6 large egg whites",
      "1-1/2 cups hazelnuts, toasted",
      "2-1/2 cups confectioners' sugar",
      "Dash salt",
      "1/2 cup superfine sugar",
      "coffee buttercream:",
      "1 cup sugar",
      "6 tablespoons water",
      "6 large egg yolks",
      "4 teaspoons instant espresso powder",
      "1 teaspoon vanilla extract",
      "1-1/2 cups butter, softened",
      "6 tablespoons confectioners' sugar"
    ],
    "directions": [
      "Place egg whites in a small bowl; let stand at room temperature for 30 minutes.",
      "Preheat oven to 350°. Place hazelnuts and confectioners' sugar in a food processor; pulse until nuts are finely ground.",
      "Add salt to egg whites; beat on medium speed until soft peaks form. Gradually add superfine sugar, 1 tablespoon at a time, beating on high until stiff peaks form. Fold in hazelnut mixture.",
      "With a pastry bag, pipe 1-in.-diameter cookies 2 in. apart onto parchment-lined baking sheets. Bake until lightly browned and firm to the touch, 9-12 minutes. Transfer cookies on the parchment to wire racks; cool completely.",
      "For the buttercream, in a heavy saucepan, combine sugar and water. Bring to a boil; cook over medium-high heat until sugar is dissolved. Remove from heat. In a small bowl, whisk a small amount of hot syrup into egg yolks; return all to pan, whisking constantly. Cook until thickened, 2-3 minutes, stirring constantly; remove from heat. Stir in espresso powder and vanilla; cool completely.",
      "In a stand mixer with the whisk attachment, beat butter until creamy. Gradually beat in cooled syrup. Beat in confectioners' sugar until fluffy. Refrigerate until mixture firms to a spreading consistency, about 10 minutes.",
      "Spread about 1-1/2 tsp buttercream onto the bottoms of half the cookies; top with remaining cookies. Store in airtight containers in the refrigerator."
    ]
  },
  {
    "id": "017",
    "dish": "Cassoulet for Today",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Virginia Anthony",
    "prepTime": "Prep: 45 min. Bake: 50 min.",
    "nutrition_facts": "1 serving: 394 calories, 14g fat (4g saturated fat), 91mg cholesterol, 736mg sodium, 29g carbohydrate (4g sugars, 8g fiber), 33g protein. Diabetic Exchanges: 4 lean meat, 2 starch, 1/2 fat.",
    "dishDesc": "'French cassoulet is traditionally cooked for hours. This version of the rustic dish offers the same homey taste in less time. It’s easy on the wallet, too.'",
    "ingredients": [
      "6 boneless skinless chicken thighs (about 1-1/2 pounds)",
      "1/4 teaspoon salt",
      "1/4 teaspoon coarsely ground pepper",
      "3 teaspoons olive oil, divided",
      "1 large onion, chopped",
      "1 garlic clove, minced",
      "1/2 cup white wine or chicken broth",
      "1 can (14-1/2 ounces) diced tomatoes, drained",
      "1 bay leaf",
      "1 teaspoon minced fresh rosemary or 1/4 teaspoon dried rosemary, crushed",
      "1 teaspoon minced fresh thyme or 1/4 teaspoon dried thyme",
      "2 cans (15 ounces each) cannellini beans, rinsed and drained",
      "1/4 pound smoked turkey kielbasa, chopped",
      "3 bacon strips, cooked and crumbled",
      "topping:",
      "1/2 cup soft whole wheat bread crumbs",
      "1/4 cup minced fresh parsley",
      "1 garlic clove, minced"
    ],
    "directions": [
      "Preheat oven to 325°. Sprinkle chicken with salt and pepper. In a broiler-safe Dutch oven, heat 2 teaspoons oil over medium heat; brown chicken on both sides. Remove from pan.",
      "In same pan, saute onion in remaining oil over medium heat until crisp-tender. Add garlic; cook 1 minute. Add wine; bring to a boil, stirring to loosen browned bits from pan. Add tomatoes, herbs and chicken; return to a boil.",
      "Transfer to oven; bake, covered, 30 minutes. Stir in beans and kielbasa; bake, covered, until chicken is tender, 20-25 minutes longer.",
      "Remove from oven; preheat broiler. Discard bay leaf; stir in bacon. Toss bread crumbs with parsley and garlic; sprinkle over top. Place in oven so surface of cassoulet is 4-5 in. from heat; broil until crumbs are golden brown, 2-3 minutes."
    ]
  },
  {
    "id": "018",
    "dish": "Finnish Salmon and Dill Pie",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Judy Batson",
    "prepTime": "Prep: 20 min. Bake: 30 min. + standing",
    "nutrition_facts": "1 piece: 448 calories, 30g fat (18g saturated fat), 179mg cholesterol, 642mg sodium, 26g carbohydrate (2g sugars, 1g fiber), 16g protein.",
    "dishDesc": "Being of Finnish heritage, I am always thrilled when I find a family recipe. This salmon and dill pie came tumbling out of one of my grandmother's books. It will be a winner at any of your social functions",
    "ingredients": [
      "1 tablespoon butter",
      "1/3 cup finely chopped green onions",
      "3/4 cup flaked smoked salmon fillets",
      "1/4 cup snipped fresh dill",
      "Dough for single-crust pie",
      "3 large eggs",
      "1 cup half-and-half cream",
      "1/4 cup all-purpose flour",
      "1/2 teaspoon salt",
      "1/2 teaspoon ground nutmeg",
      "1/2 teaspoon pepper",
      "1 cup shredded Swiss cheese"
    ],
    "directions": [
      "Preheat oven to 400°. In a small skillet, melt butter over medium heat. Add green onions; cook and stir until crisp-tender, about 3 minutes. Remove from heat. Gently stir in salmon and dill; set aside.",
      "On a lightly floured surface, roll dough to a 1/8-in.-thick circle; transfer to a 9-in. pie plate. Trim crust to 1/2 in. beyond rim of plate; flute edge. Spoon salmon mixture into crust. In a small bowl, whisk eggs, cream, flour and seasonings until blended; pour over top. Sprinkle with cheese.",
      "Bake on a lower oven rack until a knife inserted near the center comes out clean, 35-40 minutes. Cover edge loosely with foil during the last 10 minutes if needed to prevent overbrowning. Remove foil. Let stand 10 minutes before cutting."
    ]
  },
  {
    "id": "019",
    "dish": "Lemon & Dill Shrimp Sandwiches",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Monica Kolva",
    "prepTime": "Prep/Total Time: 20 min.",
    "nutrition_facts": "1 sandwich (calculated without lettuce and tomato): 534 calories, 31g fat (6g saturated fat), 156mg cholesterol, 992mg sodium, 36g carbohydrate (5g sugars, 1g fiber), 27g protein.",
    "dishDesc": "'Our family took a once-in-a-lifetime trip to Norway, where we got to eat incredible shrimp sandwiches like these. The crustier the bread, the better.'",
    "ingredients": [
      "4 hoagie buns, split",
      "1 tablespoon butter",
      "1 pound uncooked shrimp (41-50 per pound), peeled and deveined",
      "1/2 cup mayonnaise",
      "2 tablespoons lemon juice",
      "4 teaspoons snipped fresh dill or 1-1/4 teaspoons dill weed",
      "1/2 teaspoon salt",
      "1/4 teaspoon pepper",
      "Optional: Lettuce leaves and sliced tomato"
    ],
    "directions": [
      "Hollow out bun bottoms, leaving a 1/2-in. shell (save removed bread for another use). In a large skillet, heat butter over medium heat. Add shrimp; cook and stir 3-4 minutes or until shrimp turn pink.",
      "In a small bowl, mix mayonnaise, lemon juice, dill, salt and pepper until blended. Add shrimp; toss to coat. Spoon shrimp mixture into bun bottoms. If desired, top with lettuce and tomato. Replace bun tops."
    ]
  },
  {
    "id": "020",
    "dish": "Crispy Norwegian Bows",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Janie Norwood",
    "prepTime": "Prep/Total Time: 30 min.",
    "nutrition_facts": "1 cookie: 24 calories, 1g fat (0 saturated fat), 13mg cholesterol, 1mg sodium, 3g carbohydrate (1g sugars, 0 fiber), 0 protein.",
    "dishDesc": "'I've been fixing these cookies for so long, I don't recall where the recipe came from. They're a 'must' at our house.'",
    "ingredients": [
      "3 large egg yolks, room temperature",
      "3 tablespoons sugar",
      "3 tablespoons heavy whipping cream",
      "1/2 teaspoon ground cardamom",
      "1 to 1-1/4 cups all-purpose flour",
      "Oil for deep-fat frying",
      "Confectioners' sugar"
    ],
    "directions": [
      "Beat egg yolks and granulated sugar until pale yellow. Add cream and cardamom; mix well. Gradually add flour until dough is firm enough to roll.",
      "On a lightly floured surface, roll into a 15-in. square. Using a pastry wheel or knife, cut into 15x1-1/2-in. strips; cut diagonally at 2-1/2-in. intervals. In the center of each diamond, make a 1-in. slit; pull one end through slit.",
      "In an electric skillet or deep-fat fryer, heat oil to 375°. Fry bows, a few at a time, until golden brown on both sides, 20-40 seconds. Drain on paper towels. Dust with confectioners' sugar."
    ]
  },
  {
    "id": "021",
    "dish": "Classic Swedish Meatballs",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Emily Gould",
    "prepTime": "Prep: 15 min. + chilling Cook: 20 min.",
    "nutrition_facts": "1 meatball: 36 calories, 2g fat (1g saturated fat), 10mg cholesterol, 87mg sodium, 2g carbohydrate (1g sugars, 0 fiber), 3g protein.",
    "dishDesc": "'I'm a 'Svenska flicka' (Swedish girl) from northwest Iowa, where many Swedes settled at the turn of the century. This recipe was given to me by a Swedish friend. It's obviously a 20th century version of a 19th century favorite, since back then they didn't have bouillon cubes or evaporated milk! I think you'll agree that these modern-day 'Kottbullar' are very tasty.'",
    "ingredients": [
      "1-2/3 cups evaporated milk, divided",
      "2/3 cup chopped onion",
      "1/4 cup fine dry bread crumbs",
      "1/2 teaspoon salt",
      "1/2 teaspoon allspice",
      "Dash pepper",
      "1 pound lean ground beef (90% lean)",
      "2 teaspoons butter",
      "2 teaspoons beef bouillon granules",
      "1 cup boiling water",
      "1/2 cup cold water",
      "2 tablespoons all-purpose flour",
      "1 tablespoon lemon juice",
      "Canned lingonberries, optional"
    ],
    "directions": [
      "Combine 2/3 cup evaporated milk with the next 5 ingredients. Add beef; mix lightly. Refrigerate until chilled.",
      "With wet hands, shape meat mixture into 1-in. balls. In a large skillet, heat butter over medium heat. Brown meatballs in batches. Dissolve bouillon in boiling water. Pour over meatballs; bring to a boil. Cover; simmer 15 minutes.",
      "Meanwhile, stir together cold water and flour. Remove meatballs from skillet; skim fat, reserving juices. Add flour mixture and remaining 1 cup evaporated milk to pan juices; cook, uncovered, over low heat, stirring until sauce thickens.",
      "Return meatballs to skillet. Stir in lemon juice. If desired, top with lingonberries."
    ]
  },
  {
    "id": "022",
    "dish": "Swedish Cream Apple Rings",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Heather Hood",
    "prepTime": "Prep: 20 min. + chilling Bake: 25 min. + cooling",
    "nutrition_facts": "1 piece: 290 calories, 12g fat (8g saturated fat), 61mg cholesterol, 123mg sodium, 41g carbohydrate (21g sugars, 1g fiber), 4g protein.",
    "dishDesc": "'My mother made this classic coffee cake for every important holiday... Thanksgiving, Christmas and Easter. Now, I carry on the tradition. As I make them, I remember my mom, who was a lot like this recipe: soft and tasteful but full of surprises. The overnight rise let's you make the dough in advance so your morning won't be hectic.'",
    "ingredients": [
      "1 package (1/4 ounce) active dry yeast",
      "1/4 cup warm water (110° to 115°)",
      "4 cups all-purpose flour",
      "1/4 cup sugar",
      "1/2 teaspoon salt",
      "3/4 cup cold butter, cubed",
      "1 cup heavy whipping cream (110° to 115°)",
      "1/4 cup evaporated milk (110° to 115°)",
      "3 large egg yolks, room temperature",
      "filling:",
      "2 cups finely chopped peeled apples",
      "1/2 cup raisins",
      "1/4 cup cinnamon-sugar",
      "glaze:",
      "2 cups confectioners' sugar",
      "1 teaspoon vanilla extract",
      "2 to 3 tablespoons 2% milk"
    ],
    "directions": [
      "In a small bowl, dissolve yeast in warm water. In a large bowl, combine the flour, sugar and salt. Cut in butter until crumbly. Add the yeast mixture, cream, milk and egg yolks; stir until mixture forms a soft dough. Cover and refrigerate overnight.",
      "In a small bowl, combine the filling ingredients. Punch down dough; divide in half. On a lightly floured surface, roll out 1 portion into a 13x7-in. rectangle. Sprinkle with half of filling.",
      "Roll up jelly-roll style, starting with a long side. Pinch seam to seal. Place seam side down on a greased baking sheet; pinch ends together to form a ring. Repeat with remaining dough and filling. Cover and let rise in a warm place, about 45 minutes.",
      "Bake at 375° until golden brown, 25-30 minutes. Remove from pans to wire racks to cool. Combine the confectioners' sugar, vanilla and enough milk to reach a drizzling consistency. Drizzle over warm rings."
    ]
  },
  {
    "id": "023",
    "dish": "Dutch Letters",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Shirley De Lange",
    "prepTime": "Prep: 50 min. Bake: 30 min. + cooling",
    "nutrition_facts": "1 pastry: 248 calories, 16g fat (9g saturated fat), 42mg cholesterol, 182mg sodium, 25g carbohydrate (10g sugars, 1g fiber), 3g protein.",
    "dishDesc": "These S-shaped super flaky butter pastries filled with almond paste and topped with crunchy sugar are popular in both Iowa and Holland during the Christmas season. Here's a recipe that will let you make and enjoy them all year round.",
    "ingredients": [
      "1 can (8 ounces) almond paste",
      "1 cup sugar",
      "1 large egg",
      "1/2 teaspoon lemon extract",
      "dough:",
      "4 cups all-purpose flour",
      "1 teaspoon salt",
      "2 cups cold butter",
      "1 cup ice water",
      "1 large egg white",
      "2 teaspoons water"
    ],
    "directions": [
      "In a large bowl, beat the almond paste, sugar, egg and extract until smooth. Divide into 4 portions. On lightly floured waxed paper, roll each portion into a 12x1/2-in. rope; set aside.",
      "In a large bowl, combine flour and salt; cut in butter until crumbly. Gradually add water, tossing with a fork until dough forms a ball. Divide into 4 portions.",
      "On a lightly floured surface, roll out each portion into a 14x6-in. rectangle. Place 1 almond paste rope in the center of each rectangle. Moisten long edges of dough; fold over filling. Press seam to seal; tuck in ends.",
      "Transfer seam side down to greased baking sheets; form each into an 'S' shape. Whisk egg white and water; brush over dough. Using a fork, prick tops at 1-in. intervals to vent.",
      "Bake at 350° for 30-35 minutes or until golden brown. Cool on wire racks. To serve, cut into 2-in. pieces."
    ]
  },
  {
    "id": "024",
    "dish": "Dutch Baby Pancake with Strawberry-Almond Compote",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Jennifer Beckman",
    "prepTime": "Prep: 15 min. Bake: 20 min.",
    "nutrition_facts": "1 slice with 1/2 cup topping: 252 calories, 13g fat (4g saturated fat), 153mg cholesterol, 245mg sodium, 27g carbohydrate (13g sugars, 3g fiber), 9g protein. Diabetic Exchanges: 1-1/2 fat, 1 starch, 1 medium-fat meat, 1 fruit.",
    "dishDesc": "Pannekoeken, or Dutch baked pancakes, are a treat in my husband’s family. You can also try this recipe with vanilla extract, blueberries and lemon peel.",
    "ingredients": [
      "2 tablespoons butter",
      "4 large eggs, room temperature",
      "2/3 cup 2% milk",
      "2 tablespoons grated orange zest",
      "1/2 teaspoon almond extract",
      "2/3 cup all-purpose flour",
      "2 tablespoons sugar",
      "1/2 teaspoon kosher salt",
      "topping:",
      "1 pound fresh strawberries, hulled and quartered",
      "1/2 cup slivered almonds, toasted",
      "2 tablespoons orange juice",
      "1 tablespoon sugar"
    ],
    "directions": [
      "Preheat oven to 400°. Place butter in a 9-in. pie plate. Place in oven for 4-5 minutes or until butter is melted; carefully swirl to coat evenly.",
      "Meanwhile, in a large bowl, whisk eggs, milk, orange zest and extract until blended. Whisk in flour, sugar and salt. Pour into hot pie plate. Bake 20-25 minutes or until puffed and sides are golden brown and crisp.",
      "In a small bowl, combine topping ingredients. Remove pancake from oven; serve immediately with topping."
    ]
  },
  {
    "id": "025",
    "dish": "True Belgian Waffles",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Rose Delemeester",
    "prepTime": "Prep/Total Time: 30 min.",
    "nutrition_facts": "2 each: 696 calories, 41g fat (25g saturated fat), 193mg cholesterol, 712mg sodium, 72g carbohydrate (34g sugars, 1g fiber), 10g protein.",
    "dishDesc": "'It was on a visit to my husband's relatives in Europe that I was given this Belgian waffle recipe. These homemade waffles are great with any kind of topping: blueberries, strawberries, raspberries, fried apples, powdered sugar or whipped topping.'",
    "ingredients": [
      "2 cups all-purpose flour",
      "3/4 cup sugar",
      "3-1/2 teaspoons baking powder",
      "2 large eggs, separated",
      "1-1/2 cups whole milk",
      "1 cup butter, melted",
      "1 teaspoon vanilla extract",
      "Sliced fresh strawberries or syrup"
    ],
    "directions": [
      "In a bowl, combine flour, sugar and baking powder. In another bowl, lightly beat egg yolks. Add milk, butter and vanilla; mix well. Stir into dry ingredients just until combined. Beat egg whites until stiff peaks form; fold into batter.",
      "Bake in a preheated waffle iron according to manufacturer's directions until golden brown. Serve with strawberries or syrup."
    ]
  },
  {
    "id": "026",
    "dish": "Steamed Mussels with Peppers",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Taste of Home Test Kitchen",
    "prepTime": "Prep: 30 min. Cook: 10 min.",
    "nutrition_facts": "12 each: 293 calories, 12g fat (2g saturated fat), 65mg cholesterol, 931mg sodium, 12g carbohydrate (1g sugars, 1g fiber), 28g protein.",
    "dishDesc": "'Use the French bread to soak up the deliciously seasoned broth. If you like food zippy, add the jalapeno seeds.'",
    "ingredients": [
      "2 pounds fresh mussels, scrubbed and beards removed",
      "1 jalapeno pepper, seeded and chopped",
      "2 tablespoons olive oil",
      "3 garlic cloves, minced",
      "1 bottle (8 ounces) clam juice",
      "1/2 cup white wine or additional clam juice",
      "1/3 cup chopped sweet red pepper",
      "3 green onions, sliced",
      "1/2 teaspoon dried oregano",
      "1 bay leaf",
      "2 tablespoons minced fresh parsley",
      "1/4 teaspoon salt",
      "1/4 teaspoon pepper",
      "French bread baguette, sliced, optional"
    ],
    "directions": [
      "Tap mussels; discard any that do not close. Set aside. In a large skillet, saute jalapeno in oil until tender. Add garlic; cook 1 minute longer. Stir in the clam juice, wine, red pepper, green onions, oregano and bay leaf.",
      "Bring to a boil. Reduce heat; add mussels. Cover and simmer for 5-6 minutes or until mussels open. Discard bay leaf and any unopened mussels. Sprinkle with parsley, salt and pepper. Serve with baguette slices if desired."
    ]
  },
  {
    "id": "027",
    "dish": "Slow-Cooked Spicy Portuguese Cacoila",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Michele Merlino",
    "prepTime": "Prep: 20 min. + marinating Cook: 6 hours",
    "nutrition_facts": "1 sandwich: 489 calories, 20g fat (7g saturated fat), 90mg cholesterol, 1075mg sodium, 38g carbohydrate (6g sugars, 2g fiber), 34g protein.",
    "dishDesc": "'You're probably used to pulled pork coated with barbecue sauce and made into sandwiches. Portuguese pulled pork is a spicy dish often served at our large family functions. Each cook generally adds his or her own touches that reflect their taste and Portuguese heritage. A mixture of beef roast and pork can be used.'",
    "ingredients": [
      "4 pounds boneless pork shoulder butt roast, cut into 2-in. pieces",
      "1-1/2 cups dry red wine or reduced-sodium chicken broth",
      "4 garlic cloves, minced",
      "4 bay leaves",
      "1 tablespoon salt",
      "1 tablespoon paprika",
      "2 to 3 teaspoons crushed red pepper flakes",
      "1 teaspoon ground cinnamon",
      "1 large onion, chopped",
      "1/2 cup water",
      "12 bolillos or hoagie buns, split, optional"
    ],
    "directions": [
      "Place pork in a large bowl; add wine, garlic and seasonings. Turn to coat; cover and refrigerate overnight.",
      "Transfer pork mixture to a 5- or 6-qt. slow cooker; add onion and water. Cook, covered, on low 6-8 hours or until meat is tender.",
      "Skim fat. Remove bay leaves. Shred meat with 2 forks. If desired, serve with a slotted spoon on bolillos."
    ]
  },
  {
    "id": "028",
    "dish": "Shrimp Mozambique",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Christina Souz",
    "prepTime": "Prep: 20 min. Cook: 20 min.",
    "nutrition_facts": "1 serving: 223 calories, 9g fat (1g saturated fat), 184mg cholesterol, 1190mg sodium, 9g carbohydrate (4g sugars, 1g fiber), 25g protein.",
    "dishDesc": "'This shrimp Mozambique recipe was passed down from my grandma and is frequently made in our Portuguese culture. Variations include adding other seafood, such as clams, mussels or scallops. I've also made it with chicken since my kids will not eat seafood.'",
    "ingredients": [
      "3 tablespoons olive oil",
      "1 medium onion, finely chopped",
      "6 garlic cloves, minced",
      "2 pounds uncooked shell-on shrimp (16-20 per pound)",
      "2 envelopes sazon with coriander and annatto",
      "2 teaspoons garlic salt",
      "2 teaspoons garlic powder",
      "2 teaspoons onion powder",
      "1 teaspoon paprika",
      "1 bay leaf",
      "1 bottle (12 ounces) beer or 1-1/2 cups chicken broth",
      "1 teaspoon lemon juice",
      "1/4 cup ketchup",
      "3 tablespoons chopped fresh parsley",
      "Hot cooked rice"
    ],
    "directions": [
      "In a Dutch oven, heat oil over medium-high heat. Add onion; cook and stir until tender, 4-5 minutes. Add garlic and shrimp; cook 1 minute longer. Stir in seasonings. Add beer and lemon juice; bring to a boil. Reduce heat. Simmer, uncovered, until shrimp turn pink, 10-15 minutes. Stir in ketchup and parsley; discard bay leaf. Serve with rice."
    ]
  },
  {
    "id": "029",
    "dish": "Rabanadas (Portuguese French Toast)",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Ana Paula Cioffi",
    "prepTime": "Prep: 15 min. Cook: 5 min./batch",
    "nutrition_facts": "2 slices: 391 calories, 21g fat (3g saturated fat), 131mg cholesterol, 313mg sodium, 42g carbohydrate (23g sugars, 2g fiber), 11g protein.",
    "dishDesc": "'I find this dish a comforting reminder of my childhood. The creamy custard center contrasts deliciously with the cinnamon sugar crust.'",
    "ingredients": [
      "1 cup sugar",
      "2 tablespoons ground cinnamon",
      "4 large eggs",
      "2 cups 2% milk",
      "Oil for frying",
      "1 loaf (8 ounces) French bread, cut into 1-inch slices"
    ],
    "directions": [
      "In a small bowl, mix sugar and cinnamon until blended. In a large shallow dish, whisk eggs and milk. Dip both sides of bread in egg mixture, soaking lightly.",
      "In an electric skillet, heat 1 in. of oil to 350°. Working with a few slices at a time, remove bread from egg mixture, allowing excess to drain, and fry 2-3 minutes on each side or until golden brown. Drain on paper towels.",
      "Dip warm rabanadas in cinnamon-sugar to coat all sides. Serve warm or at room temperature."
    ]
  },
  {
    "id": "030",
    "dish": "Chicken Paella",
    "dishPic": "/images/savory-spring-vegetable-galettes-vicky-wasik-leeks-asparagus-mushroom.webp",
    "chef": "Taste of Home Test Kitchen",
    "prepTime": "Prep: 10 min. Cook: 45 min.",
    "nutrition_facts": "1-1/2 cups: 516 calories, 17g fat (4g saturated fat), 99mg cholesterol, 1242mg sodium, 52g carbohydrate (5g sugars, 4g fiber), 36g protein.",
    "dishDesc": "'Turmeric lends flavor and a pretty golden color to this Spanish-style entree. Haven’t tried arborio rice? You’ll love its creamy texture.'",
    "ingredients": [
      "2 boneless skinless chicken thighs (about 1/2 pound), cut into 2-inch pieces",
      "1/2 cup cubed fully cooked ham",
      "1/3 cup chopped onion",
      "1/3 cup julienned sweet red pepper",
      "1 tablespoon olive oil, divided",
      "1/2 cup uncooked arborio rice",
      "1/2 teaspoon ground turmeric",
      "1/2 teaspoon ground cumin",
      "1/2 teaspoon minced garlic",
      "1/8 teaspoon salt",
      "1 cup plus 2 tablespoons chicken broth",
      "3/4 cup frozen peas, thawed"
    ],
    "directions": [
      "In a large skillet, saute the chicken, ham, onion and red pepper in 2 teaspoons oil until chicken is browned on all sides. Remove with a slotted spoon.",
      "In the same skillet, saute rice in remaining 1 teaspoon oil until lightly browned. Stir in the turmeric, cumin, garlic and salt. Return meat and vegetables to pan; toss lightly. Add broth; bring to a boil. Reduce heat to medium; cover and simmer until rice is tender, 30-35 minutes. Stir in peas."
    ]
  }
]